Repository: MetaModels/attribute_select
Catalog: src/Resources/translations/*_metamodel_attribute.*.xlf
Languages: de, fr

# typeOptions.select
source: Select
de: Einzelauswahl [select]
fr: Sélectionner

# select_table.label
source: Source table
de: Quelltabelle
fr: Table source

# select_table.description
source: Please select the source table from where the values shall be retrieved from.
de: Bitte wählen Sie die Tabelle, aus der die Werte bezogen werden sollen.
fr: Sélectionnez la table source où les valeurs sont à récupérer;

# select_column.label
source: Value column
de: Werte-Spalte
fr: Colonne des valeurs

# select_column.description
source: Please select the column where the display text value shall be retrieved from.
de: Bitte wählen Sie die Tabellenspalte, aus der ein Textwert bezogen werden soll.
fr: Sélectionnez la colonne qui contient les valeurs de texte à afficher.

# select_id.label
source: Id column
de: ID-Spalte
fr: Colonne Id

# select_id.description
source: Please select the column that shall be used as id.
de: Bitte wählen Sie die Tabellenspalte aus, die als Datensatz-ID dienen soll.
fr: Sélectionnez la colonne à utiliser comme Id.

# select_alias.label
source: Alias column
de: Alias-Spalte
fr: Colonne Alias

# select_alias.description
source: Please select the column that shall be used as option alias (Used in filter widgets i.e.). Select the same as for the id column if unsure.
de: Bitte wählen Sie die Tabellenspalte, die als Optionsalias (zum Beispiel in Filterwidgets) benutzt werden soll. Falls Sie unsicher sind, wählen Sie dieselbe Spalte wie für die ID aus.
fr: Sélectionnez la colonne à utiliser comme alias (utilisée dans les widgets de filtre). En cas de doute, utilisez la même que la colonne Id.

# select_sorting.label
source: Select sorting
de: Auswahl-Sortierung
fr: Sélectionnez le critère de tri

# select_sorting.description
source: Please select an entry for the tag sorting.
de: Bitte wählen Sie einen Eintrag für die Tag-Sortierung aus.
fr: Sélectionnez une entrée pour le tri des étiquettes.

# select_sort.label
source: Sorting direction
de: Sortierrichtung
fr: Ordre du tri

# select_sort.description
source: The sorting direction.
de: Richtung der Sortierung.
fr: L'ordre de tri.

# select_where.description
source: The list of options can be limited by using SQL as WHERE condition - use the alias 'sourceTable' for the source table.
de: Die Liste der Optionen kann durch Verwendung von SQL als WHERE-Bedingung eingeschränkt werden - verwenden Sie den Alias 'sourceTable' für die Quelltabelle.
fr: La liste des options peut être limitée à l'aide de la commande SQL WHERE. Utilisez l'alias 'sourceTable' pour la table source.

# select_filter.label
source: Filter
fr: Filtrer

# select_filter.description
source: Here you can choose the filter to use.
de: Hier können Sie den Filter wählen.
fr: Vous pouvez choisir un filtre à utiliser.

# select_filterparams.label
source: Filter parameters
de: Filterparameter
fr: Paramètres de filtre

# select_filterparams.description
source: Here you can choose a default value for the filter.
de: Hier können Sie eine Vorgabe für den Filter wählen..
fr: Vous pouvez choisir une valeur par défaut pour le filtre.

# sql_error
source: The SQL query causes an error.
de: Die SQL-Abfrage verursacht einen Fehler.
fr: La requête SQL a provoqué une erreur.

# select_table_type.translated
source: Translated MetaModels
de: Übersetztes MetaModels
fr: MetaModels traduits

# select_table_type.untranslated
source: Untranslated MetaModels
de: Unübersetztes MetaModels
fr: MetaModels non traduits

# select_table_type.sql-table
source: SQL Table
de: SQL Tabelle
fr: Table SQL

# select_column_type.attribute
source: MetaModel attributes
de: MetaModels Attribute
fr: Attributs de MetaModel

# select_column_type.sql
source: SQL table column
de: Spalte der SQL-Tabelle
fr: Colonne de la table SQL

# select_sort_directions.asc
source: Ascending
de: Aufsteigend
fr: Ascendant

# select_sort_directions.desc
source: Descending
de: Absteigend
fr: Descendant
